#Στον παρακάτω κώδικα θέλουμε να φτιάξουμε μια κλήρωση 
#Σε αυτήν την κλήρωηση ο χρήστης θα δίνει κάποια ονόματα
#Και έπειτα αν συνδεθεί με το όνομα του θα του δώσει ένα τυχαίο όνομα απο τα ονόματα που έδωσε πρίν

import random
name_list = []
print ('Δώστε έναν αριθμό για τα άτομα που θα συμμετέχουν στην κλήρωση:')
number = int(input(''))
print (f'Τώρα δώσε το κάθε όνομα απο τα {number} άτομα που θα συμμετέχουν στην κλήρωηση:')
i = number
while i>=0:
    name = str(input(''))
    #print(name)
    name_list.append(name)
    i-=1
print(name_list)